read_verilog state_machine.v;
hierarchy -check -top state_machine;
proc; opt; fsm; opt; memory; opt
techmap; opt;
dfflibmap -liberty cmos_cells.lib;
abc -liberty cmos_cells.lib;
clean;
write_verilog state_machine_estructural.v;